app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT `cars`.* FROM `cars`

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO `cars` (`make`, `model`, `year`, `price`, `created_at`, `updated_at`) VALUES ('Maserati', 'Grandturismo', 2015, 132000, '2015-07-23 15:00:44', '2015-07-23 15:00:44')

    def set_car
      @car = Car.find(params[:id])
---
SELECT  `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1